Term4/matlog/lectures/9.tex
% Created 2021-04-16 Fri 15:17
% Intended LaTeX compiler: pdflatex

  \documentclass[english]{article}
  \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
  
  \usepackage{geometry}
  \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
   \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}
\newcommand{\llb}{\llbracket}
\newcommand{\rrb}{\rrbracket}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother

\newenvironment{rualgo}[1][]
  {\begin{algorithm}[#1]
     \selectlanguage{russian}%
     \floatname{algorithm}{Алгоритм}%
     \renewcommand{\algorithmicif}{{\color{red}\textbf{если}}}%
     \renewcommand{\algorithmicthen}{{\color{red}\textbf{тогда}}}%
     \renewcommand{\algorithmicelse}{{\color{red}\textbf{иначе}}}%
     \renewcommand{\algorithmicend}{{\color{red}\textbf{конец}}}%
     \renewcommand{\algorithmicfor}{{\color{red}\textbf{для}}}%
     \renewcommand{\algorithmicto}{{\color{red}\textbf{до}}}%
     \renewcommand{\algorithmicdo}{{\color{red}\textbf{делать}}}%
     \renewcommand{\algorithmicwhile}{{\color{red}\textbf{пока}}}%
     \renewcommand{\algorithmicrepeat}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicuntil}{{\color{red}\textbf{до тех пор пока}}}%
     \renewcommand{\algorithmicloop}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicnot}{{\color{blue}\textbf{не}}}%
     \renewcommand{\algorithmicand}{{\color{blue}\textbf{и}}}%
     \renewcommand{\algorithmicor}{{\color{blue}\textbf{или}}}%
     \renewcommand{\algorithmicrequire}{{\color{blue}\textbf{Ввод}}}%
     \renewcommand{\algorithmicrensure}{{\color{blue}\textbf{Вывод}}}%
     \renewcommand{\algorithmicreturn}{{\color{red}\textbf{Вернуть}}}%
     \renewcommand{\algorithmicrtrue}{{\color{blue}\textbf{истинна}}}%
     \renewcommand{\algorithmicrfalse}{{\color{blue}\textbf{ложь}}}%
     % Set other language requirements
  }
  {\end{algorithm}}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 9}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 9},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Теория первого порядка}
\label{sec:orgd860e13}
\begin{definition}
\textbf{Теория I порядка} --- Исчесление предикатов + нелогические функции + предикатные символы + нелогические (математические) аксиомы.
\end{definition}
\begin{definition}
Будем говорить, что \(N\) соответсвует \textbf{аксиоматике Пеано} если:
\begin{itemize}
\item задан \(('): N \to N\) --- инъективная функция (для разных элементов, разные значения)
\item задан \(0 \in N\): нет \(a \in N\), что \(a' = 0\)
\item если \(P(x)\) --- некоторое утверждение, зависящее от \(x \in N\), такое, что \(P(0)\) и всегда, когда \(P(x)\), также и \(P(x')\). Тогда \(P(x)\)
\end{itemize}
\end{definition}
\beginproperty
\begin{property}
\(0\) единственный
\label{orgde224d2}
\end{property}
\begin{proof}
\(P(x)=x = 0\) либо существует \(t:\ t' = x\)
\begin{itemize}
\item \(P(0): 0 = 0\)
\item \(P(x) \to P(x')\). Заметим, что \(x'\) --- не `ноль`
\end{itemize}
\(P(x)\) выполнено при всех \(x \in N\)
\label{org4c1cc97}
\end{proof}
\begin{definition}
\[ a + b = \begin{cases}
a & b = 0 \\
(a + c)' & b = c'
\end{cases}\]
Можем определить это опираясь на \hyperref[org4c1cc97]{доказательтво}
\end{definition}
\begin{definition}
\begin{itemize}
\item \(1 = 0'\)
\item \(2 = 0''\)
\item \(3 = 0'''\)
\item \(4 = 0''''\)
\item \(\dots\)
\end{itemize}
\end{definition}
\begin{task}
\(2 + 2 = 4\)
\end{task}
\begin{solution}
\[ 2 + 2 = 0'' + 0'' = (0'' + 0')' = ((0'' + 0)')' = ((0'')')' = 0'''' = 4 \]
\end{solution}
\begin{definition}
\[ a \cdot b = \begin{cases}
0 & b = 0 \\
(a \cdot c) + a & b = c'
\end{cases}\]
\end{definition}
\begin{definition}
\[ a^b = \begin{cases}
1 & b = 0 \\
(a^c)\cdot a & b = c'
\end{cases}\]
\end{definition}
\beginproperty
\begin{property}
\(a + 0 = 0 + a\)
\label{orgf5303ba}
\end{property}
\begin{proof}
\(P(a) = (a + 0 = 0 + a)\) \\
\uline{База} \(P(0): 0 + 0 = 0 + 0\) \\
\uline{Переход} \(P(x) \to P(x')\)
\[ x + 0 = 0 + x \]
\[ x' + 0 \xlongequal{?} 0 + x' \]
\[ 0 + x' = (0 + x)' \quad\text{определение }+ \]
\[ (0 + x)' = (x + 0)' \quad\text{предположение} \]
\[ (x + 0)' = x' \quad\text{определение }+\]
\[ x' = x' + 0 \quad\text{определение }+ \]
\end{proof}
\begin{property}
\(a + b' = a' + b\)
\end{property}
\begin{proof}
\-
\begin{description}
\item[{\(b = 0\)}] \(a + 0' = a' + 0\)
\[ a' = (a + 0)' = a + 0' = a'+0 = a' \]
\item[{\(b = c'\)}] Есть: \(a + c' = a' + c\). Покажем: \(a + c'' = a' + c'\)
\[ (a + c')' = (a' + c)' = a' + c \]
\end{description}
\end{proof}
\begin{property}
\(a + b = b + a\)
\end{property}
\begin{proof}
\uline{База} \(b = 0\) --- \hyperref[orgf5303ba]{свойство} \\
\uline{Переход} \(a + c'' = c'' + a\), если \(a + c' = c' + a\)
\[ a + c'' = (a + c')' = (c' + a)' = c' + a' = c'' + a\]
\end{proof}
\subsection{Формальная арифметика}
\label{sec:org6ce972c}
\begin{definition}
Исчесление предикатов:
\begin{itemize}
\item Функциональные символы:
\begin{itemize}
\item \(0\) --- 0-местный
\item \((')\) --- 1-местный
\item \((\cdot)\) --- 2-местный
\item \((+)\) --- 2-местный
\end{itemize}
\item \((=)\) --- 2-местный предикатный символ
\end{itemize}
Аксимомы:
\begin{enumerate}
\item \(a = b \to a' = b'\)
\item \(a = b \to a = c \to b = c\)
\item \(a' = b' \to a= b\)
\item \(\neg a' = 0\)
\item \(a + b' = (a + b)'\)
\item \(a + 0 = a\)
\item \(a\cdot 0 = 0\)
\item \(a\cdot b' = a\cdot b + a\)
\item Схема аксиом индукции:
\[ (\psi[x:=0])\&(\forall x. \psi \to (\psi[x:=x'])) \to \psi \]
\(x\) входит свободно в \(\psi\)
\end{enumerate}
\end{definition}
\beginproperty
\begin{property}
\[ ((a + 0 = a) \to (a + 0 = a) \to (a = a)) \]
\end{property}
\begin{proof}
\[ \forall a. \forall b. \forall c. a = b \to a = c \to b = c \]
\[ (\forall a. \forall b. \forall c. a = b \to a = c \to b = c) \to \forall b. \forall c. (a + 0 = b \to a + 0 = c \to b = c) \]
\[ \forall b. \forall c. a + 0 = b \to a + 0 = c\to b = c \]
\[ (\forall b. \forall c. a + 0 = b \to a + 0 = c \to b = c) \to \forall c.(a + 0 = a \to a + 0 = c \to a=c) \]
\[ \forall c. a + 0 = a \to a + 0 = c \to a = c \]
\[ (\forall c. a + 0 = a \to a + 0 = c \to a = c) \to a+0 = a \to a + 0 = a \to a= a \]
\[ a + 0  = a \to a + 0 = a \to a = a \]
\[ a + 0 = a \]
\[ a + 0 = a \to a = a \]
\[ a = a \]
\[ \forall b. \forall c. a = b \to a = c \to b = c \]
\[ (0 = 0 \to 0 = 0 \to 0 = 0) \]
\[ (\forall b. \forall c. a = b \to a = c\ to b = c) \to (0 = 0 \to 0 = 0 \to 0 = 0) \to \phi \]
\fixme
\end{proof}
\begin{definition}
\(\exists! x.\varphi(x) \equiv (\exists x. \varphi(x))\&\forall p.\forall q. \varphi(p)\&\varphi(q) \to p = q\) \\
Можно также записать \(\exists ! x.\neg \exists s. s' = x\) или \((\forall q.(\exists x. x' = q)\vee q= 0)\)
\end{definition}
\begin{definition}
\(a \le b\) --- сокращение для \(\exists n. a + n = b\)
\end{definition}
\begin{definition}
\[ \overline{n} = 0^{(n)}\]
\[ 0^{(n)} = \begin{cases}
0 & n = 0 \\
0^{(n - 1)'} & n > 0
\end{cases}\]
\end{definition}
\begin{definition}
\(W \subseteq \N_0^n\). \(W\) --- выразимое в формальной арифметике. отношение, если существует формула \(\omega\) со свободными переменными \(x_1,\dots,x_n\). Пусть \(k_1,\dots,k_n \in \N\)
\begin{itemize}
\item \((k_1,\dots,k_n) \in W\), тогда \(\vdash \omega[x_1:=\overline{k_1}, \dots, x_n := \overline{k_n}]\)
\item \((k_1,\dots,k_n) \not\in W\), тогда \(\vdash \neg \omega[x_1:=\overline{k_1},\dots,x_n:=\overline{k_n}]\)
\end{itemize}
\[ \omega[x_1:=\Theta_1,\dots,x_n:=\Theta_n] \equiv \omega(\Theta_1, \dots, \Theta_n) \]
\end{definition}
\begin{definition}
\(f: \N^n \to \N\) --- представим в формальной арифметике, если найдется \(\varphi\) --- фомула с \(n + 1\) свободными переменными \(k_1, \dots, k_{n + 1} \in \N\)
\begin{itemize}
\item \(f(k_1,\dots,k_n) = k_{n + 1}\), то \(\vdash \varphi(\overline{k_1},\dots,\overline{k_{n + 1}})\) \\
\item \(\vdash \exists! x.\varphi(\overline{k_1},\dots,\overline{k_n},x)\)
\end{itemize}
\end{definition}
\end{document}
